class AzkarModel {
  Map<String, dynamic> azkar = {
    "morning": [
      {
        "id": 1,
        "zekr":
            "أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له...",
        "repeat": 1,
        "source": "مسلم",
      },
      {
        "id": 2,
        "zekr": "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور",
        "repeat": 1,
        "source": "الترمذي",
      },
      {
        "id": 3,
        "zekr":
            "اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت...",
        "repeat": 1,
        "source": "البخاري",
      },
      {
        "id": 4,
        "zekr":
            "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
        "repeat": 3,
        "source": "أبو داود",
      },
      {
        "id": 5,
        "zekr": "رضيت بالله ربًا وبالإسلام دينًا وبمحمد ﷺ نبيًا",
        "repeat": 3,
        "source": "أبو داود",
      },
    ],

    "evening": [
      {
        "id": 101,
        "zekr":
            "أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له...",
        "repeat": 1,
      },
      {
        "id": 102,
        "zekr": "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك المصير",
        "repeat": 1,
      },
      {"id": 103, "zekr": "أعوذ بكلمات الله التامات من شر ما خلق", "repeat": 3},
    ],

    "after_prayer": [
      {"id": 201, "zekr": "أستغفر الله", "repeat": 3},
      {
        "id": 202,
        "zekr": "اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام",
        "repeat": 1,
      },
      {"id": 203, "zekr": "سبحان الله", "repeat": 33},
      {"id": 204, "zekr": "الحمد لله", "repeat": 33},
      {"id": 205, "zekr": "الله أكبر", "repeat": 34},
    ],

    "sleep": [
      {"id": 301, "zekr": "باسمك اللهم أموت وأحيا", "repeat": 1},
      {"id": 302, "zekr": "اللهم قني عذابك يوم تبعث عبادك", "repeat": 3},
      {"id": 303, "zekr": "سبحان الله", "repeat": 33},
      {"id": 304, "zekr": "الحمد لله", "repeat": 33},
      {"id": 305, "zekr": "الله أكبر", "repeat": 34},
    ],
  };
}
